# Baekjoon Online Judge - 14500번. 테트로미노

def check(x, y):
    global max_num
    # 총 19가지의 모양
    for i in range(19):
        temp = 0
        flag = True
        for j in range(4):
            nx = x + shapes[i][j][0]
            ny = y + shapes[i][j][1]
            # 범위를 벗어난 경우 더이상 카운트 X
            if nx < 0 or nx >= N or ny < 0 or ny >= M:
                flag = False
                break
            temp += area[nx][ny]
        # 최대값 판단
        if flag:
            if temp > max_num:
                max_num = temp


# [0, 0] 기준을 왼쪽 첫 시작 부분들 택
# 예시 그림 왼쪽에서 오른쪽으로 케이스 1 ~ 5
shapes = [
    [[0, 0], [0, 1], [0, 2], [0, 3]], # 케이스 1
    [[0, 0], [1, 0], [2, 0], [3, 0]],
    [[0, 0], [0, 1], [1, 0], [1, 1]], # 케이스 2
    [[0, 0], [1, 0], [2, 0], [2, 1]], # 케이스 3
    [[0, 0], [0, 1], [0, 2], [1, 0]],
    [[0, 0], [0, 1], [1, 1], [2, 1]],
    [[0, 0], [0, 1], [0, 2], [-1, 2]],
    [[0, 0], [0, 1], [-1, 1], [-2, 1]],
    [[0, 0], [1, 0], [1, 1], [1, 2]],
    [[0, 0], [0, 1], [1, 0], [2, 0]],
    [[0, 0], [0, 1], [0, 2], [1, 2]],
    [[0, 0], [1, 0], [1, 1], [2, 1]], # 케이스 4
    [[0, 0], [0, 1], [-1, 1], [-1, 2]],
    [[0, 0], [0, 1], [-1, 1], [1, 0]],
    [[0, 0], [0, 1], [1, 1], [1, 2]],
    [[0, 0], [0, 1], [1, 1], [0, 2]], # 케이스 5
    [[0, 0], [0, 1], [-1, 1], [1, 1]],
    [[0, 0], [0, 1], [-1, 1], [0, 2]],
    [[0, 0], [1, 0], [1, 1], [2, 0]],
]

N, M = map(int, input().split())
area = []
max_num = 0
for _ in range(N):
    area.append(list(map(int, input().split())))

for i in range(N):
    for j in range(M):
        check(i, j)
print(max_num)
